test-performance.yml
config:
  target: http://localhost:3000/api
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 30
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 20
      name: Spike phase
  plugins:
    ensure: {}
    apdex: {}
    expect:
      reportFailuresAsErrors: true
      outputFormat: prettyError
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75

scenarios:
  - name: Test Page d'Accueil
    flow:
      - get:
          url: '/'
          headers:
            Authorization: 'Bearer eyJhbGciOiJkaXIiLCJlbmMiOiJBMjU2R0NNIn0..khs95zo8AfDWvG42.ZNxSZ0eMP2tVO5yP-P4w1yGGVcTv8IiNQm-xrmWhMF2LByXtRCrGXFS9Mo-4VKBv2ZyPSpESYPQXb6B9rJrwe-TDI8ksY01Cb-Z4M4f84sFUA5nvN4I76l6GmMGZlUidr6IFCQYk-r1dHlbXdFlDYr_0SmS9RcHT4Yuf2aSDsHr5k0OOVaD81rPAKSqZZ5L5eIM3XH3Zv2c5KggsZGQWmNc-xgC1gm-mVpk66fG3hQbPoNEjuYgGkyNOYwEDN8N3xuuqwwZ3874.R_bmg335qSBT8OUGTW9eJQ'

  - name: Test Liste des Projets
    flow:
      - get:
          url: '/projects'
          headers:
            Authorization: 'Bearer eyJhbGciOiJkaXIiLCJlbmMiOiJBMjU2R0NNIn0..khs95zo8AfDWvG42.ZNxSZ0eMP2tVO5yP-P4w1yGGVcTv8IiNQm-xrmWhMF2LByXtRCrGXFS9Mo-4VKBv2ZyPSpESYPQXb6B9rJrwe-TDI8ksY01Cb-Z4M4f84sFUA5nvN4I76l6GmMGZlUidr6IFCQYk-r1dHlbXdFlDYr_0SmS9RcHT4Yuf2aSDsHr5k0OOVaD81rPAKSqZZ5L5eIM3XH3Zv2c5KggsZGQWmNc-xgC1gm-mVpk66fG3hQbPoNEjuYgGkyNOYwEDN8N3xuuqwwZ3874.R_bmg335qSBT8OUGTW9eJQ'

  - name: Test Création de Projet
    flow:
      - post:
          url: '/projects'
          headers:
            Authorization: 'Bearer eyJhbGciOiJkaXIiLCJlbmMiOiJBMjU2R0NNIn0..khs95zo8AfDWvG42.ZNxSZ0eMP2tVO5yP-P4w1yGGVcTv8IiNQm-xrmWhMF2LByXtRCrGXFS9Mo-4VKBv2ZyPSpESYPQXb6B9rJrwe-TDI8ksY01Cb-Z4M4f84sFUA5nvN4I76l6GmMGZlUidr6IFCQYk-r1dHlbXdFlDYr_0SmS9RcHT4Yuf2aSDsHr5k0OOVaD81rPAKSqZZ5L5eIM3XH3Zv2c5KggsZGQWmNc-xgC1gm-mVpk66fG3hQbPoNEjuYgGkyNOYwEDN8N3xuuqwwZ3874.R_bmg335qSBT8OUGTW9eJQ'
            Content-Type: application/json
          json:
            title: 'Test Project'
            description: 'This is a test project'
            budget: 1000
            status: 'active'
          capture:
            json: $.id
            as: projectId
      - get:
          url: '/projects/{{ projectId }}'
          headers:
            Authorization: 'Bearer eyJhbGciOiJkaXIiLCJlbmMiOiJBMjU2R0NNIn0..khs95zo8AfDWvG42.ZNxSZ0eMP2tVO5yP-P4w1yGGVcTv8IiNQm-xrmWhMF2LByXtRCrGXFS9Mo-4VKBv2ZyPSpESYPQXb6B9rJrwe-TDI8ksY01Cb-Z4M4f84sFUA5nvN4I76l6GmMGZlUidr6IFCQYk-r1dHlbXdFlDYr_0SmS9RcHT4Yuf2aSDsHr5k0OOVaD81rPAKSqZZ5L5eIM3XH3Zv2c5KggsZGQWmNc-xgC1gm-mVpk66fG3hQbPoNEjuYgGkyNOYwEDN8N3xuuqwwZ3874.R_bmg335qSBT8OUGTW9eJQ'

  - name: Test Récupération Projet Spécifique
    flow:
      - get:
          url: '/projects/1'
          headers:
            Authorization: 'Bearer eyJhbGciOiJkaXIiLCJlbmMiOiJBMjU2R0NNIn0..khs95zo8AfDWvG42.ZNxSZ0eMP2tVO5yP-P4w1yGGVcTv8IiNQm-xrmWhMF2LByXtRCrGXFS9Mo-4VKBv2ZyPSpESYPQXb6B9rJrwe-TDI8ksY01Cb-Z4M4f84sFUA5nvN4I76l6GmMGZlUidr6IFCQYk-r1dHlbXdFlDYr_0SmS9RcHT4Yuf2aSDsHr5k0OOVaD81rPAKSqZZ5L5eIM3XH3Zv2c5KggsZGQWmNc-xgC1gm-mVpk66fG3hQbPoNEjuYgGkyNOYwEDN8N3xuuqwwZ3874.R_bmg335qSBT8OUGTW9eJQ'

  - name: Test Mise à Jour Projet
    flow:
      - put:
          url: '/projects/1'
          headers:
            Authorization: 'Bearer eyJhbGciOiJkaXIiLCJlbmMiOiJBMjU2R0NNIn0..khs95zo8AfDWvG42.ZNxSZ0eMP2tVO5yP-P4w1yGGVcTv8IiNQm-xrmWhMF2LByXtRCrGXFS9Mo-4VKBv2ZyPSpESYPQXb6B9rJrwe-TDI8ksY01Cb-Z4M4f84sFUA5nvN4I76l6GmMGZlUidr6IFCQYk-r1dHlbXdFlDYr_0SmS9RcHT4Yuf2aSDsHr5k0OOVaD81rPAKSqZZ5L5eIM3XH3Zv2c5KggsZGQWmNc-xgC1gm-mVpk66fG3hQbPoNEjuYgGkyNOYwEDN8N3xuuqwwZ3874.R_bmg335qSBT8OUGTW9eJQ'
            Content-Type: application/json
          json:
            title: 'Updated Test Project'
            description: 'This is an updated test project'
            budget: 1500
            status: 'completed'